{
  "basics": {
    "name": "Pavan Thodima",
    "label": "MS Computer Science Student",
    "image": "",
    "email": "pthodima@gmail.com",
    "phone": "(608)515-1098",
    "url": "https://pthodima.github.io",
    "summary": "MS Computer Science student at UW-Madison with research interests in Artificial Intelligence, Machine Learning, Computer Vision, Game Theory, and Computer Systems. Former Senior Software Engineer at BNY with 3 years of industry experience.",
    "location": {
      "city": "Madison",
      "countryCode": "US",
      "region": "Wisconsin"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "pthodima",
        "url": "https://github.com/pthodima"
      },
      {
        "network": "LinkedIn",
        "username": "pavan-thodima",
        "url": "https://www.linkedin.com/in/pavan-thodima/"
      }
    ]
  },
  "education": [
    {
      "institution": "University of Wisconsin - Madison",
      "location": "Madison, Wisconsin",
      "url": "https://www.wisc.edu/",
      "area": "Computer Science",
      "studyType": "Master of Science",
      "startDate": "2024-09",
      "endDate": "Present",
      "score": "CGPA: In first semester",
      "courses": []
    },
    {
      "institution": "Birla Institute of Technology and Science (BITS) Pilani",
      "location": "Hyderabad, India",
      "url": "https://www.bits-pilani.ac.in/",
      "area": "Computer Science",
      "studyType": "Bachelor of Engineering",
      "startDate": "2017-08",
      "endDate": "2021-06",
      "score": "8.17/10",
      "courses": []
    }
  ],
  "work": [
    {
      "name": "Wision Lab",
      "position": "Graduate Researcher (Independent Study)",
      "url": "",
      "startDate": "2025-09",
      "endDate": "Present",
      "summary": "",
      "highlights": [
        "Engineered Motion-Metering, an efficient algorithm for high-fidelity image reconstruction from Quanta (single-photon) sensors, enabling effective extreme dynamic range viewing.",
        "Validated algorithm efficacy by benchmarking feature consistency in Vision Foundation Models (e.g., DiNOv2) fed with reconstructed Quanta outputs.",
        "Benchmarked robustness of classical and deep CV pipelines against photon-starved and high-motion sensor data."
      ]
    },
    {
      "name": "Bank of New York Mellon",
      "position": "Senior Full Stack Software Development Engineer",
      "url": "https://www.bny.com/",
      "startDate": "2023-07",
      "endDate": "2024-08",
      "summary": "",
      "highlights": [
        "Played the role of technical release manager and adhered to technology change management protocols for application packaging and deployment.",
        "Architected and created multiple data management and approval systems for a data intensive regulatory reporting application, serving as the bank's will incase of financial crisis.",
        "Spearheaded the design and execution of a customized GIT branching strategy, tailored specifically to the needs of a team transitioning from waterfall approach to agile methodologies.",
        "Served on the technical interview panel to assess candidates for both full time roles and internships.",
        "Provided software solutions and developed reusable frameworks that are employed across multiple lines of business as a member of the Java Guild."
      ]
    },
    {
      "name": "Bank of New York Mellon",
      "position": "Software Development Engineer",
      "url": "https://www.bny.com/",
      "startDate": "2021-07",
      "endDate": "2023-07",
      "summary": "",
      "highlights": [
        "Designed and developed POCs to enhance and mordernize the navigation systems, boosting a critical business application's responsiveness and user experience.",
        "Built an ensemble learning model combining Random Forest, Logistic Regression and Decision trees to detect fradulent transactions, with an ROC/AUC of over 96%.",
        "Created a data pipeline that onboards consolidated critical business data into a centralized database consumed by regulatory and resiliency applications."
      ]
    },
    {
      "name": "Piramal Group",
      "position": "Data Science Intern",
      "url": "https://www.piramalfinance.com/",
      "startDate": "2021-01",
      "endDate": "2021-06",
      "summary": "",
      "highlights": [
        "Implemented a machine learning model to perform customer data segmentation and anomaly detection to identify untapped market segments.",
        "Developed a data migration pipeline to unify multiple postgres databases into a central snowflake warehouse entity",
        "Handled data-preprocessing and feature selection using techniques like encoding, binning, Gower's distance metric, and FAMD(Feature Analysis of Mixed Data)",
        "Utilized several machine learning models like DBSCAN, OPTICS, Isolation Forest, and Agglomerative Hierarchical Clustering to analyze the customer data.",
        "Visualized the organization's attrition data using a Power BI dashboard."
      ]
    },
    {
      "name": "Bank of New York Mellon",
      "position": "Software Development Intern",
      "url": "https://www.bny.com/",
      "startDate": "2020-05",
      "endDate": "2020-07",
      "summary": "",
      "highlights": [
        "Developed a chatbot to answer compliance and process queries and assist employees in updating personal information.",
        "Utilized RASA and Facebook's Ducking for Natural Language Processing and deployed it as an Angular application using Docker and Kubernetes."
      ]
    },
    {
      "name": "JSW Steel",
      "position": "Software Development Intern",
      "url": "",
      "startDate": "2019-05",
      "endDate": "2019-07",
      "summary": "",
      "highlights": [
        "Developed a Production Parameter and Control monitoring application to analyze and share multiple KPIs of plants in the factory."
      ]
    }
  ],
  "skills": [
    {
      "name": "Deep Learning & GenAI",
      "level": "",
      "icon": "fa-solid fa-brain",
      "keywords": [
        "PyTorch",
        "Diffusion Models",
        "VAEs",
        "Object Detection",
        "Transformers",
        "HuggingFace",
        "LangChain",
        "vLLM",
        "RAG",
        "Stable Diffusion"
      ]
    },
    {
      "name": "MLOps & Cloud",
      "level": "",
      "icon": "fa-solid fa-cloud",
      "keywords": [
        "AWS",
        "Docker",
        "Kubernetes",
        "MLflow",
        "Ray",
        "Git",
        "CI/CD",
        "Linux"
      ]
    },
    {
      "name": "Languages & Data",
      "level": "",
      "icon": "fa-solid fa-code",
      "keywords": [
        "Python",
        "C++",
        "CUDA",
        "Java",
        "Javascript",
        "TypeScript",
        "SQL",
        "Spark",
        "Kafka",
        "Redis",
        "MongoDB"
      ]
    },
    {
      "name": "Development Frameworks",
      "level": "",
      "icon": "fa-solid fa-laptop-code",
      "keywords": [
        "Angular",
        "Springboot",
        "Flask",
        "Django",
        "FastAPI",
        "Flutter",
        "Firebase",
        "Android Studio"
      ]
    }
  ],
  "publications": [
    {
      "name": "Sparks of Cooperative Reasoning: LLMs as Strategic Hanabi Agents",
      "publisher": "Under Review at ICLR 2026",
      "releaseDate": "2025-01-01",
      "url": "",
      "summary": "Accepted to NeurIPS 2025 LAW Workshop & ICML 2025 MAS Workshop",
      "highlights": [
        "Evaluated 15+ state-of-the-art LLMs on the cooperative card game Hanabi to assess theory-of-mind capabilities.",
        "Released a Reinforcement Learning from AI Feedback (RLAIF) dataset containing dense move ratings from LLMs.",
        "Demonstrated that prompting agents with deductive reasoning significantly improves cooperative zero-shot performance."
      ]
    }
  ],
  "projects": [
    {
      "name": "Deep Learning Framework in C++ & CUDA",
      "summary": "",
      "highlights": [
        "Architected a lightweight, device-agnostic deep learning framework in C++ mimicking PyTorch’s nn.Module API, supporting dynamic graph construction.",
        "Implemented custom CUDA kernels for linear layers and activations, achieving a 13x speedup with OpenMP multi-threading and significant GPU acceleration.",
        "Engineered a memory-efficient training pipeline with manual host-device memory management, successfully training a neural network on MNIST."
      ],
      "startDate": "2025-01",
      "endDate": "2025-05"
    },
    {
      "name": "Conditional Diffusion Image Generation",
      "summary": "",
      "highlights": [
        "Developed a conditional DDPM in PyTorch with sinusoidal time & label embeddings plus SpatialTransformer modules; trained on MNIST to reach SSIM 0.98 in 1,000 denoising steps.",
        "Extended to latent diffusion on the AFHQ-cat subset by integrating VAE decoding; generated 50K samples achieving FID 13.2 (−2.4 vs. baseline)."
      ],
      "startDate": "2024-11",
      "endDate": "2024-12"
    },
    {
      "name": "Anchor-Free Object Detection (FCOS)",
      "summary": "",
      "highlights": [
        "Implemented an end-to-end FCOS one-stage object detector with ResNet–FPN backbone, focal & GIoU losses, and centerness head in PyTorch, training on ≈16K Pascal VOC 2007 + 2012 images; achieved 37.9% mAP (+2.4% vs. baseline) with multi-scale augmentation.",
        "Engineered a high-throughput inference pipeline (vectorized box decoding, confidence thresholding, batched NMS) to serve at 45 fps on A100 GPUs; built visualization tools for real-time training diagnostics."
      ],
      "startDate": "2024-10",
      "endDate": "2024-11",
      "url": "https://github.com/pthodima/FCOS-Object-Detection"
    },
    {
      "name": "Evolution of Semantics in Diffusion Models",
      "summary": "",
      "highlights": [
        "Analyzing the evolution of semantic features during the diffusion denoising process"
      ],
      "startDate": "2025-11",
      "endDate": "Present"
    },
    {
      "name": "Hand Sign Recognition",
      "summary": "",
      "highlights": [
        "Developed a hand sign recognition system using Convex Hull generation and defect detection.",
        "Used Open CV for image processing and convex hull and defect calculation.",
        "Experimented with Neural Networks for classification of multiple hand signs."
      ],
      "startDate": "2020-10",
      "endDate": "2020-12"
    }
  ],
  "volunteer": [
    {
      "organization": "Placement Training",
      "position": "Trainer",
      "startDate": "2023-03",
      "endDate": "2023-04",
      "summary": "SR University, Warangal (collaboration with Ez Trainings and Technologies)",
      "highlights": [
        "Trained over 200 college seniors in Data Structures and Algorithms and Object Oriented Programming.",
        "Advised students with career decisions, interview preparation and helped them overcome their job search anxiety."
      ]
    },
    {
      "organization": "Bank of New York Mellon",
      "position": "Mentor",
      "startDate": "2023-08",
      "endDate": "2023-10",
      "summary": "Mentoring a Recent College Graduate",
      "highlights": [
        "Facilitated the transition of a recent college graduate from academics to the corporate.",
        "Guided and supported the mentee in becoming acquainted with contemporary industry coding standards and practices like code review and Agile methodologies."
      ]
    }
  ],
  "awards": [],
  "certificates": [],
  "interests": [
    {
      "name": "Research Interests",
      "icon": "fa-solid fa-microscope",
      "keywords": [
        "Artificial Intelligence",
        "Machine Learning",
        "Computer Vision",
        "Game Theory",
        "Computer Systems"
      ]
    }
  ],
  "references": []
}